In [24]:
import pandas as pd
import numpy as np

In [25]:
df = pd.DataFrame({
    "number":["A",6,"C","D",4,9,1],
    "class":["A3","D5","B12","C153","B65","A1","C43"]
})
df.head()

  number class
0      A    A3
1      6    D5
2      C   B12
3      D  C153
4      4   B65

In [26]:
# Extract numrical part from number 
df["numeric_number"] =  pd.to_numeric(df["number"],errors="coerce",downcast="integer")

In [27]:
# Extract Categorical part from number 
df["categorical_number"] = np.where(df["numeric_number"].isnull(),df["number"],np.nan)

In [28]:
# Extract Categorical part from Class 
df["categorical_class"] = df["class"].str.extract(r"([A-Z])+")

In [29]:
# Extract numerical part from Class 
df["numerical_class"] = df["class"].str.extract(r"(\d+)").astype(int)

In [30]:
df.head()

,number,class,numeric_number,categorical_number,categorical_class,numerical_class
0,A,A3,NaN,A,A,3
1,6,D5,6.0,NaN,D,5
2,C,B12,NaN,C,B,12
3,D,C153,NaN,D,C,153
4,4,B65,4.0,NaN,B,65